cases/periodicHill_kOmegaSST/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother        DICGaussSeidel;
        tolerance       1e-06;
        relTol          0.05;
    }

    "(U|k|omega)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0.1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    // Conventional SIMPLE (not SIMPLEC) with explicit field under-relaxation:
    // the periodic-hill wake is weakly unsteady and SIMPLEC with high momentum
    // relaxation settles into a limit cycle (p residual plateaus ~0.3) instead
    // of a steady state. Standard under-relaxation drives it to convergence.
    consistent      no;
    pRefCell        0;
    pRefValue       0;

    // Stop automatically once the flow is statistically steady.
    residualControl
    {
        p           1e-5;
        U           1e-5;
        "(k|omega)" 1e-5;
    }
}

relaxationFactors
{
    fields
    {
        p           0.3;
    }
    equations
    {
        U           0.7;
        "(k|omega)" 0.7;
    }
}


// ************************************************************************* //
